app/controllers/api/profiles_controller.rb

INSERT INTO "profiles" ("user_id", "profile_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["profile_name", "mike"], ["created_at", "2022-07-14 18:55:20.045936"], ["updated_at", "2022-07-14 18:55:20.045936"]]
---
    def create
        @profile = Profile.new(profile_params)
        @profile.user_id = current_user.id

        if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 5]]
---
    def destroy
        @profile = Profile.find(params[:id])
        if (@profile && current_user.profiles.length > 1)
            @profile.delete